Revit 2018 API
IExternalResourceUIServer.HandleLoadResourceResults Method
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
void HandleLoadResourceResults(
	Document document,
	IList<ExternalResourceLoadData> loadData
)
Visual Basic
Sub HandleLoadResourceResults ( _
	document As Document, _
	loadData As IList(Of ExternalResourceLoadData) _
)
Visual C++
void HandleLoadResourceResults(
	Document^ document,
	IList<ExternalResourceLoadData^>^ loadData
)
Parameters
document
Type: Autodesk.Revit.DB.Document
loadData
Type: System.Collections.Generic.IList<ExternalResourceLoadData>
See Also
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace